Comment: Created with Recipe Robot v2.4.1 (https://github.com/homebysix/recipe-robot)
Description: Downloads the latest version of Gyroflow.
Identifier: com.github.ByteMe64.download.Gyroflow
Input:
  NAME: Gyroflow
MinimumVersion: '2.3'
Process:
- Arguments:
    asset_regex: .*\.dmg$
    github_repo: gyroflow/gyroflow
  Processor: GitHubReleasesInfoProvider
- Arguments:
    filename: '%NAME%-%version%.dmg'
  Processor: URLDownloader
- Processor: EndOfCheckPhase
- Arguments:
    input_path: '%pathname%/Gyroflow.app'
    requirement: identifier "xyz.gyroflow" and anchor apple generic and certificate
      1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13]
      /* exists */ and certificate leaf[subject.OU] = RR3ZC2L4DF
  Processor: CodeSignatureVerifier
- Arguments:
    input_plist_path: '%pathname%/Gyroflow.app/Contents/Info.plist'
    plist_version_key: CFBundleShortVersionString
  Processor: Versioner
