Comment: Created with Recipe Robot v2.4.1 (https://github.com/homebysix/recipe-robot)
Description: Downloads the latest version of Gyroflow and imports it into Munki.
Identifier: com.github.ByteMe64.munki.Gyroflow
Input:
  MUNKI_REPO_SUBDIR: apps/%NAME%
  NAME: Gyroflow
  pkginfo:
    catalogs:
    - testing
    description: Video stabilization using gyroscope data
    developer: Adrian Ross
    display_name: Gyroflow
    name: '%NAME%'
    unattended_install: true
MinimumVersion: '2.3'
ParentRecipe: com.github.ByteMe64.download.Gyroflow
Process:
- Arguments:
    pkg_path: '%pathname%'
    repo_subdirectory: '%MUNKI_REPO_SUBDIR%'
  Processor: MunkiImporter
