<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Identifier</key>
    <string>com.github.ByteMe64.download.Gyroflow</string>
    <key>Description</key>
    <string>Downloads the latest version of Gyroflow.</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Gyroflow</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>GitHubReleasesInfoProvider</string>
            <key>Arguments</key>
            <dict>
                <key>github_repo</key>
                <string>gyroflow/gyroflow</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>filename</key>
                <string>%NAME%.dmg</string>
                <key>url</key>
                <string>%url%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>DmgMounter</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%/Gyroflow.app</string>
                <key>requirement</key>
                <string>identifier "com.gyroflow.Gyroflow" and anchor apple generic and certificate 1[field.1.2.840.1135.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.1135.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "46792B6E64"</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>