<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Identifier</key>
    <string>com.github.ByteMe64.munki.DaVinciResolve</string>
    <key>Description</key>
    <string>Finds the DaVinci Resolve DMG in the Downloads folder and imports it into Munki.</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>DaVinci Resolve</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/blackmagic</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>DaVinci Resolve is a professional video editing, color correction, visual effects and audio post production solution.</string>
            <key>display_name</key>
            <string>DaVinci Resolve</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>FileFinder</string>
            <key>Arguments</key>
            <dict>
                <key>pattern</key>
                <string>/Users/paul/Downloads/DaVinci_Resolve_*_Mac.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
            <key>Arguments</key>
            <dict>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
                <key>pkg_path</key>
                <string>%found_filename%</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>