<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest Spotify and imports into Munki.

For Apple Silicon set DOWNLOAD_ARCH to "ARM64" and SUPPORTED_ARCH to "arm64" (default)

For Intel leave DOWNLOAD_ARCH empty and set SUPPORTED_ARCH to "x86_64"

Note: 1.0.50 and 1.0.51 versions of Spotify has mode 744 for its executables,
causing the app to not launch for any user except the user who installed
it, root in the case of Munki. Currently a postinstall_script fixes this issue
by adding group and owner +x to these files.

Related GitHub issue:
https://github.com/autopkg/recipes/issues/196
</string>
    <key>Identifier</key>
    <string>com.github.autopkg.munki.Spotify</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Spotify</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/spotify</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
                <string>deploy</string>
            </array>
            </key>catagory</key>
            <string>Default apps</string>
            <key>description</key>
            <string>Spotify is a music streaming service offering unlimited streaming of selected music from a range of major and independent record labels.</string>
            <key>display_name</key>
            <string>Spotify</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>postinstall_script</key>
            <string>#!/bin/bash
                # Add directory traversal for the entire application and ensure 
                # all executables are executable by group and other
                /bin/chmod -R go+rX /Applications/Spotify.app
            </string>
            <key>supported_architectures</key>
            <array>
                <string>%SUPPORTED_ARCH%</string>
            </array>
            <key>unattended_install</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>ParentRecipe</key>
    <string>com.github.paul01.download.Spotify</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
